backend/app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    decoded = JsonWebToken.decode(token)
    @current_user = User.find(decoded[:user_id]) if decoded
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1