backend/app/controllers/auth_controller.rb

  def signup
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("email", "password", "name", "age", "created_at", "updated_at", "password_digest") VALUES ('diegosanmaritnabarca@gmail.com', NULL, 'DiegoSanma', 22, '2026-01-04 17:57:34.221198', '2026-01-04 17:57:34.221198', '$2a$12$bJ5t.JKc9vQ358HyN0At4uGRRiV9iaueRRqvxoTPmyDoqZ9aRnkkq') RETURNING "id"

  def login
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'diegosanmartinabarca@gmail.com' LIMIT 1