backend/app/controllers/friend_requests_controller.rb

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."receiver_id" = 2 AND "friend_requests"."status" = 0
---
    def create
        receiver = User.find_by(id: params[:receiver_id])
        if receiver.nil?
            render json: { error: "Receiver not found." }, status: :not_found
            return
        end
        requets = FriendRequest.new(sender: @current_user, receiver: receiver, status: :pending)
        if requets.save
            render json: { message: "Friend request sent." }, status: :created
        else
            render json: { error: requets.errors.full_messages.join(", ") }, status: :unprocessable_entity