backend/app/controllers/user_controller.rb

    def index
        users = User.all.select(:id, :name, :email)
---
SELECT "users"."id", "users"."name", "users"."email" FROM "users"